spring-boot-soap-webservice/src/main/resources/user-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:us="http://webservice.com/spring-boot-soap-webservice">
<soapenv:Header/>
      <soapenv:Body>
      <us:getUserRequest>
        <us:name>Emre</us:name>
      </us:getUserRequest>
      </soapenv:Body>

</soapenv:Envelope>
